### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_eks_node_group.managed_ng has changed
!   resource "aws_eks_node_group" "managed_ng" {
        id                     = "jingood2-dev-eks:general-20230412071036731100000009"
+       labels                 = {}
        tags                   = {
            "Name"                                       = "jingood2-dev-eks-general"
            "environment"                                = "dev"
            "k8s.io/cluster-autoscaler/enabled"          = "TRUE"
            "k8s.io/cluster-autoscaler/jingood2-dev-eks" = "owned"
            "kubernetes.io/cluster/jingood2-dev-eks"     = "owned"
            "managed-by"                                 = "terraform-aws-eks-blueprints"
            "owners"                                     = "jingood2"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_eks_node_group.managed_ng must be replaced
+/- resource "aws_eks_node_group" "managed_ng" {
!       arn                    = "arn:aws:eks:us-east-1:484752921218:nodegroup/jingood2-dev-eks/general-20230412071036731100000009/5ac3ba26-a87d-9c83-4446-825d559ba772" -> (known after apply)
!       id                     = "jingood2-dev-eks:general-20230412071036731100000009" -> (known after apply)
!       instance_types         = [ # forces replacement
-           "t3a.medium",
+           "t3a.large",
        ]
-       labels                 = {} -> null
!       node_group_name        = "general-20230412071036731100000009" -> (known after apply)
!       release_version        = "1.25.7-20230406" -> (known after apply)
!       resources              = [
-           {
-               autoscaling_groups              = [
-                   {
-                       name = "eks-general-20230412071036731100000009-5ac3ba26-a87d-9c83-4446-825d559ba772"
                    },
                ]
-               remote_access_security_group_id = ""
            },
        ] -> (known after apply)
!       status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name"                                       = "jingood2-dev-eks-general"
            "environment"                                = "dev"
            "k8s.io/cluster-autoscaler/enabled"          = "TRUE"
            "k8s.io/cluster-autoscaler/jingood2-dev-eks" = "owned"
            "kubernetes.io/cluster/jingood2-dev-eks"     = "owned"
            "managed-by"                                 = "terraform-aws-eks-blueprints"
            "owners"                                     = "jingood2"
        }
        # (9 unchanged attributes hidden)

!       update_config {
-           max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>